[
  [
    "Title",
    "URL",
    "Published Date",
    "Author",
    "Summary",
    "Content",
    "Categories",
    "Scraped",
    "",
    ""
  ],
  [
    "Borderlands Mexico: Tariffs drive job losses at Mexico’s border factories",
    "https://www.freightwaves.com/news/borderlands-mexico-tariffs-drive-job-losses-at-mexicos-border-factories",
    "2025-08-24 11:00:00",
    "Noi Mahoney",
    "<p>This week in Borderlands: Border factories losing jobs, production to tariffs; Echo Global Logistics joins U.S. Customs trade security program; and Mexico sets record with $34B in foreign investment over two years. </p>\n<p>The post <a href=\"https://www.freightwaves.com/news/borderlands-mexico-tariffs-drive-job-losses-at-mexicos-border-factories\">Borderlands Mexico: Tariffs drive job losses at Mexico’s border factories</a> appeared first on <a href=\"https://www.freightwaves.com\">FreightWaves</a>.</p>",
    "Borderlands is a weekly rundown of developments in the world of United States-Mexico cross-border trucking and trade. This week: Tariffs drive job losses at Mexico’s border factories; Echo Global Logistics joins U.S. Customs trade security program; and Mexico sets record with $34B in foreign investment over two years.\nTariffs drive job losses at Mexico’s border factories\nMexico’s maquiladora industry is facing mounting pressure from U.S. tariffs, with factories shedding tens of thousands of jobs in June.\nThe Manufacturing, Maquiladora, and Export Services Industry (IMMEX) program\nreported\na 2.4% year-over-year decline in employment, with 76,800 jobs lost in June. Total employment across IMMEX factories dropped to 3.2 million workers.\nThe manufacturing sector saw a 2.9% reduction in personnel, while subcontracted workers fell sharply — down 22.7% compared to June 2024.\nThe monthly statistics overview was produced by Mexico’s\nNational Institute of Statistics and Geography\n.\nFor decades, ...",
    "Borderlands: Mexico, News, Top Stories, Trucking, Borderlands, US-Mexico trade",
    "FALSE",
    "FreightWaves",
    "2025-08-24 21:25:03"
  ],
  [
    "Import slide continues after early peak",
    "https://www.freightwaves.com/news/import-slide-continues-after-early-peak",
    "2025-08-24 0:30:00",
    "Zach Strickland, FW Market Expert &#38; Market Analyst",
    "<p>Are declining import bookings a response to erratic trade policy, or are there broader economic signals to be gleaned?</p>\n<p>The post <a href=\"https://www.freightwaves.com/news/import-slide-continues-after-early-peak\">Import slide continues after early peak</a> appeared first on <a href=\"https://www.freightwaves.com\">FreightWaves</a>.</p>",
    "Chart of the Week:\nInbound Ocean TEUs Volume Index – USA\nSONAR\n:\nIOTI.USA\nBookings of containers bound for the U.S. (IOTI) have fallen 20% over the past six weeks, signaling that importers may have fully recovered from early-year inventory concerns. After plunging in May, imports surged to an early peak when the president paused the 145% tariff on Chinese goods. Now, companies appear to be trying to avoid another inventory hangover as questions persist about the health of the consumer. What does this mean for transportation markets for the rest of the year?\nShifts in sourcing\nUpstream, one of the biggest shifts has been the continued pullback from China. Import bookings from China to the U.S. are down 25% year-over-year, while Vietnam is one of the few countries showing annual growth as of last week.\nChina has offset much of the decline, however, as total export bookings remain nearly flat compared to 2024, according to SONAR data. The takeaway is that global trade flows are rapidly ad...",
    "Chart of the Week, container shipping, freight demand, holiday shipping, imports",
    "FALSE",
    "FreightWaves",
    "2025-08-24 21:25:03"
  ],
  [
    "Global postal operators suspend parcel service to US",
    "https://www.freightwaves.com/news/us-de-minimis-suspension-europe",
    "2025-08-22 19:36:32",
    "Eric Kulisch",
    "<p>The end of the U.S. de minimis exemption is disrupting European postal service for parcel customers. </p>\n<p>The post <a href=\"https://www.freightwaves.com/news/us-de-minimis-suspension-europe\">Global postal operators suspend parcel service to US</a> appeared first on <a href=\"https://www.freightwaves.com\">FreightWaves</a>.</p>",
    "(\nUPDATED: Aug. 23, 2025, 3 p.m. ET\n)\nEuropean postal operators are alerting businesses and individuals that end of the U.S. de minimis exemption on small-dollar shipments from all countries, which currently can be imported duty-free, has curtailed their ability to ship packages to the United States. Posts in Asia are also pausing service.\nThe new measure will significantly impact postal operators and customers worldwide. Postal operators across Europe are actively working together on solutions to meet the new requirements imposed by the United States. PostEurope, which represents 51 European postal companies, said on Tuesday that key details, such as how U.S. customs duties will be collected and what data must be submitted to U.S. authorities, have yet to be fully defined. U.S. Customs and Border Protection issued limited technical guidance on Aug. 15, leaving little time for full implementation by the deadline.\n“If critical issues and processes are not defined and, thus, compliant so...",
    "Air Cargo, American Shipper, News, Parcel Freight, PostalMag, Top Stories, Trade and Compliance, cross-border commerce, de minimis, e-commerce, postal carriers, U.S.Postal Service",
    "FALSE",
    "FreightWaves",
    "2025-08-24 21:25:03"
  ],
  [
    "Are You Even Ready to Grow – Lessons Every Owner-Operator Needs Before Adding a Truck",
    "https://www.freightwaves.com/news/are-you-even-ready-to-grow-lessons-every-owner-operator-needs-before-adding-a-truck",
    "2025-08-22 18:20:32",
    "Adam Wingfield",
    "<p>Why This Class Matters in a Down Market Rates are tight, volumes are shifting, and fuel isn’t doing anyone any favors. A lot of carriers are hanging on by a thread, and in a down market, it’s natural to think adding a second truck might help you grow your way out of it. But here’s [&#8230;]</p>\n<p>The post <a href=\"https://www.freightwaves.com/news/are-you-even-ready-to-grow-lessons-every-owner-operator-needs-before-adding-a-truck\">Are You Even Ready to Grow – Lessons Every Owner-Operator Needs Before Adding a Truck</a> appeared first on <a href=\"https://www.freightwaves.com\">FreightWaves</a>.</p>",
    "",
    "Education and Training, The Playbook, container shipping, FreightWaves, logistics, Trucking",
    "FALSE",
    "",
    ""
  ],
  [
    "Trans-Pacific container rates fall to pre-Red Sea crisis levels",
    "https://www.freightwaves.com/news/trans-pacific-container-rates-fall-to-pre-red-sea-crisis-levels",
    "2025-08-22 16:42:00",
    "Stuart Chirls",
    "<p>Container rates on the closely-watched eastbound trans-Pacific fall to their lowest levels since before the Red Sea crisis erupted in 2023. </p>\n<p>The post <a href=\"https://www.freightwaves.com/news/trans-pacific-container-rates-fall-to-pre-red-sea-crisis-levels\">Trans-Pacific container rates fall to pre-Red Sea crisis levels</a> appeared first on <a href=\"https://www.freightwaves.com\">FreightWaves</a>.</p>",
    "",
    "American Shipper, Container Shipping, Maritime, News, Top Stories, #trade, China, container shipping, Freightos, Red Sea, Tariffs",
    "FALSE",
    "",
    ""
  ],
  [
    "🎣 Trucker Visa Freeze",
    "https://www.freightcaviar.com/trucker-visa-freeze/",
    "2025-08-22 12:57:07",
    "Adriana Pulley",
    "Plus: CarrierOK unveils a web of carriers linked to fatal Florida U-turn crash, and more.",
    "Good Friday morning.\nA fatal Florida crash has sparked a federal probe, and now, with CarrierOK’s deep dive, a disturbing pattern has come to light. Fake addresses. Recycled MCs. Missed red flags. Our feature story unpacks how this one crash exposed a decade of FMCSA failures.\nPlus,\n🚨 U.S. halts work visas for truckers\n⚖️ Rise in \"Thermonuclear\" Verdicts\n🔒 L.A. Stores Tied to $4.5M Cargo Thefts\n... and more.\nToday's Newsletter is Brought to You by\nEpay Manager\n.\nRead the full story\nSign up\nnow to read the full story and get access to all posts for\nsubscribers only.\nSubscribe\nAlready have an account?\nSign in",
    "Newsletters",
    "FALSE",
    "FreightCaviar",
    "2025-08-24 21:25:03"
  ],
  [
    "U.S. Freezes Work Visas for Commercial Truck Drivers",
    "https://www.freightcaviar.com/u-s-freezes-work-visas-for-commercial-truck-drivers/",
    "2025-08-22 11:30:59",
    "Jerome Washington",
    "The U.S. has frozen work visas for foreign truck drivers. This comes after the fatal U-turn Florida crash",
    "The Trump administration has halted the issuance of work visas for foreign commercial truck drivers, citing safety concerns and economic impacts on American drivers. The decision follows a fatal crash in Florida on August 12 that reignited debate over licensing standards and the role of foreign labor in trucking.\nSecretary of State Marco Rubio announced the suspension on August 21 via X:\nWhile some like Danielle Chaffin have voiced their support of this measure:\nWe will be interviewing her today on\nFreight Gong Friday\n, so be sure to check it out:\nOthers, however, are a bit pessimistic about this new revelation with some saying:\n\"Soooo if rates increase, who ends up paying for it…….. the brokers, the companies that hire the trucks to move goods OR inevitably the consumer that buys the goods, be careful what you wish for\"\nAnd another saying:\n\"Rates to Laredo, TX are about to go through the roof …\"\nTake a look at\nUSA_Transportation's Instagram\nto view the full comments on this story.\nFed...",
    "Policy, Trucking, FMCSA",
    "FALSE",
    "FreightCaviar",
    "2025-08-24 21:25:03"
  ],
  [
    "Thermonuclear Verdicts Intensify Legal Risks for Trucking",
    "https://www.freightcaviar.com/thermonuclear-verdicts-intensify-legal-risks-for-trucking/",
    "2025-08-22 11:00:58",
    "Jerome Washington",
    "Trucking faces escalating legal risks as nuclear and “thermonuclear” jury verdicts climb to record levels. A new report shows where cases are rising",
    "The trucking industry is facing heightened exposure to “nuclear” and “thermonuclear” jury verdicts, according to a new report by Marathon Strategies. The study found that trucking and automotive companies together saw $1.4 billion in jury awards last year, as verdicts exceeding $100 million surged nationwide.\nNuclear and Thermonuclear Verdicts on the Rise\nThe report,\nCorporate Verdicts Go Thermonuclear\n, outlined a sharp increase in high-dollar awards:\n135 nuclear verdicts\n(awards over $10 million) were issued in 2024 — a 52% rise from 2023.\n49 thermonuclear verdicts\n(awards of at least $100 million) were recorded, up 81% year over year.\nIn total, these verdicts amounted to\n$31.3 billion in damages\n, more than doubling the 2023 figure.\nMost of these cases were decided in state courts, which saw $20 billion in awards across 85 cases, compared with $11 billion across 50 cases in federal courts.\nImpact on Trucking and Automotive Cases\nTrucking was directly tied to two major thermonuclear ...",
    "Legal/Lawsuit, Trucking",
    "FALSE",
    "",
    ""
  ],
  [
    "L.A. Hardware Store Exposed as $4.5 Million Cargo Theft Operation",
    "https://www.freightcaviar.com/l-a-hardware-store-exposed-as-4-5-million-cargo-theft-operation/",
    "2025-08-22 10:30:59",
    "Jerome Washington",
    "Authorities say two Los Angeles hardware stores were fronts for a $4.5 million cargo theft ring in Southern California.",
    "Two Los Angeles-area hardware stores have been exposed as fronts for a major cargo theft ring responsible for moving an estimated $4.5 million in stolen goods. According to the Los Angeles Police Department, items taken from trains, trucks, and cargo ships, including power tools, e-bikes, and appliances from brands such as Dyson, Milwaukee, DeWalt, and Makita, were recovered.\nLAPD Chief Jim McDonnell said the operation, run out of DJ General Tool & Wire’s Montebello and Huntington Park locations, demonstrates the increasing scope of organized cargo theft in Southern California.\nArrest and Charges\nThe owner, 41-year-old Dojoon Park of Montebello, was arrested on suspicion of receiving stolen property. Prosecutors say charges will carry significant penalties.\n“We are in the process of fully evaluating the crimes that he has committed, and we anticipate charges being brought against him ... that will involve maximum sentences of years of state prison time,” Los Angeles County District Att...",
    "Cargo Theft",
    "FALSE",
    "",
    ""
  ],
  [
    "The Data Said the Truck Was Parked. The Camera Caught It Moving.",
    "https://www.freightcaviar.com/the-data-said-the-truck-was-parked-the-camera-caught-it-moving/",
    "2025-08-21 15:00:47",
    "Jerome Washington",
    "When ELD tampering and GPS spoofing go unchecked, gaps in trailer visibility open the door to cargo theft. Here’s how GenLogs is using visual intelligence to close that gap.",
    "A False Sense of Freight Security\nIn theory,\nElectronic Logging Devices (ELDs)\nand\nGPS\nsignals are a freight broker’s best friend. They verify a truck’s movement, confirm driver compliance, and provide real-time location visibility. But in practice, those data points can lie. And lately, they’ve been lying more often, and more convincingly.\nGPS and ELDs promise accountability, but what happens when that data’s fake? Or when a trailer moves without the tractor? That’s not just a risk, it’s a liability.\nWe’re unpacking how\nELD manipulation, GPS spoofing, and limited trailer visibility\nare creating new risks in modern logistics and how camera-based data is helping uncover what digital platforms are missing.\nELDs Are Not Tamper-Proof\nSecurity concerns around ELDs date back to the moment they were mandated. In 2020, the FBI warned that ELDs could be tampered with through malware, spoofed GPS signals, or unauthorized edits. By 2024, researchers had confirmed that it was even possible to wire...",
    "Sponsored Content",
    "FALSE",
    "",
    ""
  ]
]